{
    "base_model_name_or_path": "Qwen/Qwen2.5-7B-Instruct",
    "peft_type": "LORA",
    "r": 16,
    "lora_alpha": 32,
    "lora_dropout": 0.05,
    "target_modules": [
        "q_proj",
        "v_proj"
    ],
    "modules_to_save": null
}